# --- Flutter & Dart ---
alexisvt.flutter-snippets
dart-code.dart-code
dart-code.flutter
google.arb-editor
localizely.flutter-intl

# --- AI & Cloud ---
google.geminicodeassist
google.gemini-cli-vscode-ide-companion
anthropic.claude-code
#gitHub.copilot
#gitHub.copilot-chat
openai.chatgpt

# --- DevOps Tools ---
ms-azuretools.vscode-docker
ms-azuretools.vscode-containers
ms-kubernetes-tools.vscode-kubernetes-tools
hashicorp.terraform

# --- Python & Geral ---
ms-python.python
ms-python.vscode-pylance
ms-python.debugpy
ms-python.isort
eamodio.gitlens
donjayamanne.githistory
pkief.material-icon-theme
vscode-icons-team.vscode-icons
yzhang.markdown-all-in-one

# --- Remote ---
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode-remote.remote-ssh
